In [2]:
#Import initial libraries and dataset

import numpy as np
import pandas as pd

df=pd.read_csv('data/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S

In [3]:
#Number of rows and columns in dataset (rows, columns)
df.shape

(891, 10)

In [4]:
#Finding the number of missing values for each feature
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
#finding and replacing the missing values with mean of non-null values of age
df['Age']=df['Age'].replace(np.NaN,df['Age'].mean())
df['Age'][:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [6]:
#encoding categorical data to numerical: 
Gender = {"Sex":{"male": 0, "female": 1}}
df = df.replace(Gender)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,35.0,373450,8.0500,NaN,S

In [7]:
# drop some irrelevant features

df.drop(['Name', 'PassengerId', 'Ticket', 'Embarked', 'Cabin'], axis=1, inplace=True)
df.head()

   Survived  Pclass  Sex   Age     Fare
0         0       3    0  22.0   7.2500
1         1       1    1  38.0  71.2833
2         1       3    1  26.0   7.9250
3         1       1    1  35.0  53.1000
4         0       3    0  35.0   8.0500

In [8]:
# Split the dataset into input and target features

X=df.drop('Survived', axis=1)
y=df.Survived

In [9]:
# Split the input and target features into training and testing set
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=1)

In [10]:
from sklearn.neighbors import KNeighborsClassifier

# create knn classifier
knn = KNeighborsClassifier(n_neighbors = 3)

#fit the data
knn.fit(X_train,y_train)

KNeighborsClassifier(n_neighbors=3)

In [12]:
#make prediction
y_pred=knn.predict(X_test)

In [18]:
from sklearn.metrics import accuracy_score,confusion_matrix

knn_accuracy = round(accuracy_score(y_test, y_pred), 4)
print("Accuarcy",knn_accuracy*100)

Accuarcy 70.15

In [19]:
#Confusion matrix
print(confusion_matrix(y_test,y_pred))

[[125  28]
 [ 52  63]]